In [1]:
import pandas as pd

In [2]:
Data=pd.read_csv('Titanic.csv',usecols=['Sex'])

In [3]:
Data

        Sex
0      male
1    female
2    female
3    female
4      male
..      ...
886    male
887  female
888  female
889    male
890    male

[891 rows x 1 columns]

In [4]:
pd.get_dummies(Data).head()

   Sex_female  Sex_male
0           0         1
1           1         0
2           1         0
3           1         0
4           0         1

In [5]:
pd.get_dummies(Data,drop_first=True).head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [6]:
Data=pd.read_csv('Titanic.csv',usecols=['Embarked'])

In [7]:
Data

    Embarked
0          S
1          C
2          S
3          S
4          S
..       ...
886        S
887        S
888        S
889        C
890        Q

[891 rows x 1 columns]

In [8]:
Data['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [9]:
Data['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [10]:
Data['Embarked'].mode()

0    S
dtype: object

In [11]:
Data['Embarked'].value_counts()[0]

644

In [12]:
Data['Embarked'].value_counts().index[0]

'S'

In [13]:
pd.get_dummies(Data,drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

In [14]:
Data=pd.read_csv('Mercedes_Benz.csv',usecols=['X0','X1','X2','X3','X4','X5'])

In [15]:
Data.head()

   X0 X1  X2 X3 X4 X5
0   k  v  at  a  d  u
1   k  t  av  e  d  y
2  az  w   n  c  d  x
3  az  t   n  f  d  x
4  az  v   n  f  d  h

In [16]:
Data['X1'].value_counts()[0:10]

aa    833
s     598
b     592
l     590
v     408
r     251
i     203
a     143
c     121
o      82
Name: X1, dtype: int64

In [17]:
Data['X1'].value_counts().head(10)

aa    833
s     598
b     592
l     590
v     408
r     251
i     203
a     143
c     121
o      82
Name: X1, dtype: int64

In [18]:
Data['X1'].unique()

array(['v', 't', 'w', 'b', 'r', 'l', 's', 'aa', 'c', 'a', 'e', 'h', 'z',
       'j', 'o', 'u', 'p', 'n', 'i', 'y', 'd', 'f', 'm', 'k', 'g', 'q',
       'ab'], dtype=object)

In [19]:
for i in Data.columns:
    print(len(Data[i].unique()))

47
27
44
7
4
29

In [20]:
List_10=Data['X1'].value_counts().head(10).index

In [21]:
List_10=list(List_10)

In [22]:
List_10

['aa', 's', 'b', 'l', 'v', 'r', 'i', 'a', 'c', 'o']

In [23]:
import numpy as np

In [24]:
for i in List_10:
    Data[i]=np.where(Data['X1']==i,1,0)

In [25]:
Data[List_10]

      aa  s  b  l  v  r  i  a  c  o
0      0  0  0  0  1  0  0  0  0  0
1      0  0  0  0  0  0  0  0  0  0
2      0  0  0  0  0  0  0  0  0  0
3      0  0  0  0  0  0  0  0  0  0
4      0  0  0  0  1  0  0  0  0  0
...   .. .. .. .. .. .. .. .. .. ..
4204   0  1  0  0  0  0  0  0  0  0
4205   0  0  0  0  0  0  0  0  0  1
4206   0  0  0  0  1  0  0  0  0  0
4207   0  0  0  0  0  1  0  0  0  0
4208   0  0  0  0  0  1  0  0  0  0

[4209 rows x 10 columns]

In [26]:
List_10.append('X1')

In [27]:
Data[List_10]

      aa  s  b  l  v  r  i  a  c  o X1
0      0  0  0  0  1  0  0  0  0  0  v
1      0  0  0  0  0  0  0  0  0  0  t
2      0  0  0  0  0  0  0  0  0  0  w
3      0  0  0  0  0  0  0  0  0  0  t
4      0  0  0  0  1  0  0  0  0  0  v
...   .. .. .. .. .. .. .. .. .. .. ..
4204   0  1  0  0  0  0  0  0  0  0  s
4205   0  0  0  0  0  0  0  0  0  1  o
4206   0  0  0  0  1  0  0  0  0  0  v
4207   0  0  0  0  0  1  0  0  0  0  r
4208   0  0  0  0  0  1  0  0  0  0  r

[4209 rows x 11 columns]

In [28]:
import datetime

In [29]:
Today_Date=datetime.datetime.today()

In [30]:
Today_Date

datetime.datetime(2020, 10, 26, 11, 37, 24, 772282)

In [31]:
# LIST COMPREHENSION
Days=[Today_Date-datetime.timedelta(x) for x in range(0,15)]

In [32]:
Data=pd.DataFrame(Days)
Data.columns=['Day']

In [33]:
Data

                          Day
0  2020-10-26 11:37:24.772282
1  2020-10-25 11:37:24.772282
2  2020-10-24 11:37:24.772282
3  2020-10-23 11:37:24.772282
4  2020-10-22 11:37:24.772282
5  2020-10-21 11:37:24.772282
6  2020-10-20 11:37:24.772282
7  2020-10-19 11:37:24.772282
8  2020-10-18 11:37:24.772282
9  2020-10-17 11:37:24.772282
10 2020-10-16 11:37:24.772282
11 2020-10-15 11:37:24.772282
12 2020-10-14 11:37:24.772282
13 2020-10-13 11:37:24.772282
14 2020-10-12 11:37:24.772282

In [34]:
Data['Day'].dt.month

0     10
1     10
2     10
3     10
4     10
5     10
6     10
7     10
8     10
9     10
10    10
11    10
12    10
13    10
14    10
Name: Day, dtype: int64

In [35]:
Data['Weekday']=Data['Day'].dt.weekday

In [36]:
pd.to_datetime(Data['Day']).dt.weekday

0     0
1     6
2     5
3     4
4     3
5     2
6     1
7     0
8     6
9     5
10    4
11    3
12    2
13    1
14    0
Name: Day, dtype: int64

In [37]:
Data

                          Day  Weekday
0  2020-10-26 11:37:24.772282        0
1  2020-10-25 11:37:24.772282        6
2  2020-10-24 11:37:24.772282        5
3  2020-10-23 11:37:24.772282        4
4  2020-10-22 11:37:24.772282        3
5  2020-10-21 11:37:24.772282        2
6  2020-10-20 11:37:24.772282        1
7  2020-10-19 11:37:24.772282        0
8  2020-10-18 11:37:24.772282        6
9  2020-10-17 11:37:24.772282        5
10 2020-10-16 11:37:24.772282        4
11 2020-10-15 11:37:24.772282        3
12 2020-10-14 11:37:24.772282        2
13 2020-10-13 11:37:24.772282        1
14 2020-10-12 11:37:24.772282        0

In [38]:
# PROBABILITY RATIO ENCODING:

In [39]:
Data=pd.read_csv('Titanic.csv',usecols=['Cabin','Survived'])

In [40]:
Data.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [41]:
Data['Cabin'].fillna('Missing',inplace=True)

In [42]:
Data.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [43]:
Data['Cabin']=Data['Cabin'].astype(str).str[0]

In [44]:
Data

     Survived Cabin
0           0     M
1           1     C
2           1     M
3           1     C
4           0     M
..        ...   ...
886         0     M
887         1     B
888         0     M
889         1     C
890         0     M

[891 rows x 2 columns]

In [45]:
Data.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64